{
    "roles": [
        {
            "title": "Dealer of smiles and wonder",
            "summary": "Making cards change colors at a spectators command or passing coins through a spectator’s hand – Igor lived to see eyes go wide and mouths gape with wonder. Igor especially loved it when strangers got drawn in against their inner objections, or when a kid having a meltdown, or a grown up looking miserable, forgot their troubles. Once Igor learned <a href=\"/magic\">magic</a>, that consumed his free time and became his favorite tool.",
            "full_text": "full text"
        },
        {
            "title": "Mostly car free spirit",
            "summary": "Igor took a strange pleasure in not driving. Riding his folding <a href=\"/bike\">bike</a>, or making a long day of public transit with Zach and Amelia. Igor would take the kids on the bus, to the train, to the airport, to ride the airport elevators, just to reverse the process and head home so he could enjoy his kids, and the bus, without spending a dime.",
            "full_text": "full text"
        },
        {
            "title": "Disciple of the 7 habits of highly effective people",
            "summary": "Igor became enthralled by the <a href=\"/7-habits\">7 habits of highly effective people</a>, and used it as his personal life guide. He created a <a href=\"https://www.youtube.com/watch?v=_1J7GM3GLzw&amp;list=PLJveOxX-mxxCl4YDfHMyNzMmWUMFxgC1n\">7 habits video series</a> so he could better understand the concepts and teach them to others.",
            "full_text": "full text"
        },
        {
            "title": "Fit fellow",
            "summary": "Igor knew physical health was the <a href=\"https://medium.com/being-healthy/physical-health-a2f648e7574c#.g30t2werl\">source of his energy</a> and acted accordingly. Every month Igor pledged his weight would be 140lbs, and he put <a href=\"http://ighealth.blogspot.com/2014/10/the-best-1000-i-did-spend.html\">1000$ on the line</a> to make sure he never reneged on his pledge. Igor valued his cardio vascular endurance and tried to run a fast 4 miles 2 to 3 times a week. Igor also tried to incorporate biking into his life whenever possible: biking to work, biking to doctors appointments, and even biking the grocery store (which was not efficient nor effective, but enjoyable). Finally, Igor knew the importance of sleep, and always woke up @ 5am. When Igor was having trouble getting enough sleep, he’d cut his caffeine to make sure his body forced him to get the sleep he needed.",
            "full_text": "full text"
        },
        {
            "title": "Emotionally healthy human",
            "summary": "Igor understood emotional health is the basis of his stability, and <a href=\"/search-inside-yourself\">invested</a> heavily. Igor started each day at 5am by recording his blessing in his gratefulness journal, followed by 20 minutes of meditation. Igor closed the day in a similar vein, a final 10 minutes of meditation and writing out what made his day great in his gratefulness journal.",
            "full_text": "full text"
        },
        {
            "title": "Husband to Tori - his life long partner.",
            "summary": "Becoming a husband started <a href=\"http://ig66.blogspot.com/2012/02/how-igor-met-tori-genesis-story.html?q=when+tori+met+igor\">when Igor met Tori</a>, and then took several twists and turns to get <a href=\"http://ig66.blogspot.com/2015/01/married-check.html?q=when+tori+met+igor\">married</a>. Tori values her privacy so this section will be Tori light, and Igor heavy.",
            "full_text": "full text"
        },
        {
            "title": "Technologist",
            "summary": "Igor loved technology - taking copious <a href=\"https://github.com/idvorkin/techdiary\">notes</a> through his technical journeys, putzing with his <a href=\"https://github.com/idvorkin/idvorkin.github.io\">blog</a> and many small <a href=\"https://github.com/idvorkin\">projects</a>. Igor was REALLY proud when Zach got his own <a href=\"https://www.zacookiegames.com\">website</a>, and when Zach made his first <a href=\"https://github.com/idvorkin/zdvorkinweb/pull/5\">pull request</a>. Igor was also very proud of his first open source <a href=\"https://github.com/Homebrew/homebrew-core/pull/48163\">pull request</a> for a command line spell checking installer.",
            "full_text": "full text"
        },
        {
            "title": "Professional",
            "summary": "Igor didn’t write this section - but he did describe his <a href=\"/job\">dream job</a> and his thoughts on being a good <a href=\"/manager\">manager</a>. He also wrote up several cool things he’s proud of at work:",
            "full_text": "full text"
        },
        {
            "title": "Family man",
            "summary": "Igor used to think being a family man would be easy. Being proud of his family, looking back fondly on time with them was easy, but making the time for them, supporting them, teaching them - that was all really hard. Hard yes, but totally worth it.",
            "full_text": "full text"
        },
        {
            "title": "Father to Amelia - an incredible girl",
            "summary": "Things I cherish with Amelia @ 6:",
            "full_text": "full text"
        },
        {
            "title": "Father to Zach - a wonderful boy",
            "summary": "Things I cherish with Zach @ 10:",
            "full_text": "full text"
        }
    ]
}
